app/controllers/moedas_controller.rb

  def index
    @moedas = Moeda.all
---
SELECT `moedas`.* FROM `moedas`

  def create
    @moeda = Moeda.new(moeda_params)

    respond_to do |format|
      if @moeda.save
---
INSERT INTO `moedas` (`nome`, `sigla`, `url_imagem`, `created_at`, `updated_at`) VALUES ('BitCoin', 'BT', 'aaaaaaaaaaa', '2023-02-22 05:27:00', '2023-02-22 05:27:00')

  def update
    respond_to do |format|
      if @moeda.update(moeda_params)
---
UPDATE `moedas` SET `nome` = 'BitCoin222', `updated_at` = '2023-02-22 05:27:26' WHERE `moedas`.`id` = 1

  def destroy
    @moeda.destroy
---
DELETE FROM `moedas` WHERE `moedas`.`id` = 1

    def set_moeda
      @moeda = Moeda.find(params[:id])
---
SELECT  `moedas`.* FROM `moedas` WHERE `moedas`.`id` = 1 LIMIT 1